posts/notes_on_gastritis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on Gastritis</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/asset/css/style.css"/><link rel="stylesheet" href="/asset/css/prism.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on Gastritis</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#what-is-gastritis">What is Gastritis?</a>
<ul>
<li><a href="#acute-gastritis">Acute Gastritis</a></li>
<li><a href="#chronic-gastritis">Chronic Gastritis</a></li>
<li><a href="#symptoms-and-diagnosis-of-chronic-gastritis">Symptoms and Diagnosis of Chronic Gastritis</a></li>
<li><a href="#causes-of-chronic-gastritis">Causes of Chronic Gastritis</a></li>
<li><a href="#treatment-and-management-of-chronic-gastritis">Treatment and Management of Chronic Gastritis</a></li>
</ul>
</li>
<li><a href="#conclusion">Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction">Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
My journey into studying gastroenterology started with a suprising conversation with a gastroenterologist that assured me that long term use of proton pump inhibitors<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> was safe and that many of his patients have had no problem with them. This contradicted warnings against prolonged use mentioned in patient information leaflets of these class of medications. There is also significant evidence contrary to the case showing increased risk of <a href="https://www.bmj.com/content/344/bmj.e372">hip fracturs</a>, <a href="https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2481157#ioi150096r1">chronic kidney disease</a>, <a href="http://gut.bmj.com/content/early/2015/12/30/gutjnl-2015-310861.abstract">disrupted bacterial balance</a>, <a href="https://www.sciencedirect.com/science/article/pii/S2049080122015229">nutritional deficiencies</a> and <a href="https://jamanetwork.com/journals/jamaneurology/fullarticle/2487375">dementia</a>.
</p>

<p>
This inconsistency made me question the conventional approach to treating stomach inflammation and inspired me to explore this topic further. In this series, we'll delve into various gastroenterology topics, starting with an overview of gastritis, its causes, symptoms, and treatments.
</p>
</div>
</div>
<div id="outline-container-what-is-gastritis" class="outline-2">
<h2 id="what-is-gastritis">What is Gastritis?</h2>
<div class="outline-text-2" id="text-what-is-gastritis">
<p>
Gastritis, a common yet often misunderstood condition which affects a significant portion of the population. This inflammation of the stomach lining can lead to various symptoms and, if left untreated can cause serious complications.
</p>

<p>
There are two types of gastritis:
</p>
<ul class="org-ul">
<li><b>Acute Gastritis</b></li>
<li><b>Chronic Gastritis</b></li>
</ul>
</div>

<div id="outline-container-acute-gastritis" class="outline-3">
<h3 id="acute-gastritis">Acute Gastritis</h3>
<div class="outline-text-3" id="text-acute-gastritis">
<p>
Acute gastritis is often characterized by a marked infiltration of neutrophilic leukocytes<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> in the stomach's lining. This condition typically results from infections caused by invasive organisms<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>

<p>
One specific and severe form is phlegmonous (or suppurative<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>) gastritis. This type infects the deeper layers of the stomach, namely the submucosa and muscularis propria, while usually sparing the innermost layer, the mucosa.
</p>

<p>
Despite its severity, phlegmonous gastritis is relatively rare. However, its rarity contributes to a significant challenge: it is often diagnosed late due to its non-specific symptoms, leading to a high fatality rate of 70%. Given its complexity and rarity, a detailed discussion on this specific gastritis type extends beyond the scope of this overview.
</p>
</div>
</div>

<div id="outline-container-chronic-gastritis" class="outline-3">
<h3 id="chronic-gastritis">Chronic Gastritis</h3>
<div class="outline-text-3" id="text-chronic-gastritis">
<p>
Chronic gastritis, a common form of gastritis, is characterized by the presence of both neutrophils and chronic inflammatory cells within the
stomach lining. A key aspect of chronic gastritis is its role as a risk factor for other serious conditions. Notably, it is associated with an increased risk of Peptic Ulcer Disease (PUD) and various gastric neoplasms, including adenocarcinoma and lymphoma. Additionally, there is a subset known as non-Helicobacter pylori gastritis. The exact cause of this type of gastritis remains largely unknown in many cases, presenting a challenge in both understanding and managing the condition.
</p>
</div>
</div>

<div id="outline-container-symptoms-and-diagnosis-of-chronic-gastritis" class="outline-3">
<h3 id="symptoms-and-diagnosis-of-chronic-gastritis">Symptoms and Diagnosis of Chronic Gastritis</h3>
<div class="outline-text-3" id="text-symptoms-and-diagnosis-of-chronic-gastritis">
<p>
Symptoms of gastritis can range from mild to severe and include abdominal pain, bloating, nausea, vomiting, and indigestion. In chronic cases, loss of appetite, weight loss, and gastrointestinal bleeding may occur. Diagnosis typically involves a review of medical history, physical examination, and may include endoscopy, blood tests, stool tests, or breath tests to identify H. pylori infection, which is the most common cause of chronic gastritis.
</p>
</div>
</div>

<div id="outline-container-causes-of-chronic-gastritis" class="outline-3">
<h3 id="causes-of-chronic-gastritis">Causes of Chronic Gastritis</h3>
<div class="outline-text-3" id="text-causes-of-chronic-gastritis">
<p>
Several factors can lead to the development of gastritis:
</p>

<ul class="org-ul">
<li><b>Infections</b>: Helicobacter pylori, Mycobacteria, Actinomycosis,
Syphilis, HHV5 (Human Herpesvirus 5 in immuno-compromised),
Candidiasis, and parasitic infections like Anisakidosis, Ascariasis,
Necatoriasis, and Capillariasis.</li>
<li><b>Lifestyle Factors</b>: Excessive alcohol consumption, smoking, and
chronic stress.</li>
<li><b>Medications</b>: Prolonged use of NSAIDs (nonsteroidal anti-inflammatory
drugs).</li>
<li><b>Autoimmune Disorders</b>: In some cases, the body's immune system
attacks stomach cells.</li>
<li><b>Other Causes</b>: Include bile reflux, infections, and certain diseases
like Crohn's.</li>
</ul>
</div>
</div>

<div id="outline-container-treatment-and-management-of-chronic-gastritis" class="outline-3">
<h3 id="treatment-and-management-of-chronic-gastritis">Treatment and Management of Chronic Gastritis</h3>
<div class="outline-text-3" id="text-treatment-and-management-of-chronic-gastritis">
<p>
The treatment of gastritis depends on its cause:
</p>
<ul class="org-ul">
<li><b>Eradicating H.pylori</b>: If caused by H. pylori, antibiotics and proton pump inhibitors are used.</li>
<li><b>Medication Adjustments</b>: If drug-induced, alternatives to</li>
</ul>
<p>
NSAIDs may be recommended.
</p>
<ul class="org-ul">
<li><b>Lifestyle Changes</b>: Reducing alcohol intake, quitting smoking, and managing stress.</li>
<li><b>Dietary Adjustments</b>: Avoiding spicy, acidic, or fried foods can alleviate symptoms.</li>
</ul>

<p>
In more severe cases, additional medical interventions may be necessary and is highly dependent on the underlying cause if it can be identified. There are other proposed treatments such as <a href="https://pubmed.ncbi.nlm.nih.gov/22932084/">"gastroprotective" agents</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion">Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
Gastritis, though common, can be effectively managed with the right approach. Understanding its causes, recognizing symptoms early, and adhering to treatment plans are key. Through lifestyle adjustments and medical interventions, individuals can lead a healthy, symptom-free life with careful management of their lifestyle.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Proton pump inhibitors are medications that are used to reduce
stomach acid production. They do so by irreversibly inhibiting
  the proton pump in the stomach. These class of medications are
  also one of the most commonly prescribed medications in the
  world.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Neutrophilic leukocytes are a type of white blood cell and are
part of the body's immune response that is often recruited to
sites of inflammation or infection.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
These invasive organisms have been identified as including
gram-negative bacilli, anerobes, gram-positive cocci including
group A streptocci and fungi.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
meaning pus filled and implying that there is a severe infection.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>